using ScienceActivityRecorder.Models;
using ScienceActivityRecorder.Providers;
using ScienceActivityRecorder.Repositories;
using System;
using System.Collections.Generic;

namespace ScienceActivityRecorder.Configuration
{
    public static class ProfilesSeed
    {
        private static readonly List<Profile> profiles = new List<Profile>
        {
            new Profile
            {
                LastName = "Арбузова",
                FirstName = "Юлія",
                MiddleName = "Вікторівна",
                BirthDate = new DateTime(1978, 7, 19),
                Position = "Старший викладач, Херсонський політехнічний коледж Одеського національного політехнічного університету, викладач, з 2001",
                Degree = "спеціаліст вищої категорії,  викладач-методист, голова циклової комісії",
                EducationalInstitution = "Херсонський державний технічний  університет,  «Програмне забезпечення автоматизованих систем», 2001р., спеціаліст з програмного забезпечення автоматизованих систем.",
                AcademicDisciplines = "Основи програмування та алгор. мови (98), Об`єктно - орієнтоване програмування (58)",
                AdvancedTraining = "Аспірантура, 01.11.2013 – 30.10.2017, НАПН ДВНЗ «Університет менеджменту освіти», 18.01.2016– 29.01.2016 свідоцтво 12 СПВ № 144059 від 29.01.2016, тема «Діагностика якості проведення навчальних занять у коледжі, технікумі»",
                Seniority = "16",
                HomeAddress = "м. Херсон, вул. 200 річчя Херсона, буд. 32, кв. 84, (0552) 53-79-36",
            },

            new Profile
            {
                LastName = "Живець",
                FirstName = "Алла",
                MiddleName = "Миколаївна",
                BirthDate = new DateTime(1971, 05, 20),
                Position = "Старший викладач",
                Degree = "Кандидат економічних наук, спеціаліст вищої категорії",
                EducationalInstitution = "Херсонський індустріальний інститут, 1995 р., «Бухгалтерський облік, контроль і аналіз господарської діяльності», економіст; Херсонський індустріальний інститут, 1996 р., «Облік і аудит», магістр з обліку і аудиту",
                AcademicDisciplines = "Управлінський облік (44), Облік і звітність оподаткування (46), Податкова система (72), Основи оподаткування (78), Фіскальне адміністрування (36)",
                AdvancedTraining = "НДПКБ «Управлінські технології», 18.12.2015 – 18.01.2016, дов. № К-12 від 21.01.2016, «Маркетинг В2В», «Бізнес-планування та прогнозування діяльності підприємств», «Управління прибутком і оптимізація витрат»",
                Seniority = "16",
                HomeAddress = "м. Херсон, вул. Кримська, буд. 130, кв. 15, 0509840590"
            },

            new Profile
            {
                LastName = "Карлова",
                FirstName = "Наталя",
                MiddleName = "Іванівна",
                BirthDate = new DateTime(1956, 5, 25),
                Position = "Старший викладач",
                Degree = "спеціаліст вищої категорії, викладач",
                EducationalInstitution = "Дніпропетровський державний університет, 1978р. «Прикладна математика», математик. стажування за програмою «Застосування та розробка СУБД з точки зору новітніх комп’ютерних технологій»",
                AcademicDisciplines = "Бази даних (58), Основи програмної інженерії (78)",
                AdvancedTraining = "Херсонський політехнічний коледж  ОНПУ, 09.01.2014 – 25.01.2014, свідоцтво № 032 від 28.02.2014, стажування «Використання інформаційно – комунікаційних технологій у навчальному процесі при підготовці фахівців»",
                Seniority = "16",
                HomeAddress = "м. Херсон, вул. Московська, буд. 64, кв. 5, (0552) 22-94-24"
            },

            new Profile
            {
                LastName = "Комліченко",
                FirstName = "Оксана",
                MiddleName = "Олександрівна",
                BirthDate = new DateTime(1972, 9, 26),
                Position = "Завідувач кафедрою",
                Degree = "Кандидат економічних наук, доцент за кафедрою «Природничо-наукової підготовки», спеціаліст вищої категорії",
                EducationalInstitution = "Херсонський державний сільськогоспо-дарський інститут, 1997 р. «Облік і аудит», спеціаліст, економіст з обліку і аудиту",
                AcademicDisciplines = "Бухгалтерський облік (загальна теорія) (68), Аналіз господарської діяльності (36), Фінансовий облік (104), Бухгалтерський облік видів діяльності (40)",
                AdvancedTraining = "Херсонський національний технічний університет, 02.02.2015-14.02.2015, свідоцтво № 103 від 14.02.2015, «Методичні вказівки  до дистанційного навчання з дисципліни «Фінансовий облік» за змістовим модулем «Облік власного капіталу та активів підприємства»",
                Seniority = "25",
                HomeAddress = ""
            },

            new Profile
            {
                LastName = "Нарожний",
                FirstName = "Олександр",
                MiddleName = "Васильович",
                BirthDate = new DateTime(1980, 1, 31),
                Position = "Доцент, Херсонський політехнічний коледж Одеського національного політехнічного університету, заступник директора, з 2001",
                Degree = "кандидат технічних наук, доцент за кафедрою «Природничо-наукової підготовки» спеціаліст вищої категорії",
                EducationalInstitution = "Херсонський державний технічний університет, 2002р.  «Програмне забезпечення автоматизованих систем», спеціаліст з програмного забезпечення автоматизованих систем",
                AcademicDisciplines = "Алгоритми та структури даних (70), Математичні методи дослідження операцій (60)",
                AdvancedTraining = "ТОВ «ЗЕД-прайс», 10.01.17 – 31.01.17, довідка № 6-01/17 від 31.01.2017, стажування «Використання OLAP-техологій при роботі з обємними структурами даних» Університет менеджменту освіти НАПН України 18.02.2013 – 20.09.2013, свідоцтво № 585/12 і від 20.09.2013, «Автоматизований процес знань студентів під час навчальної практики»",
                Seniority = "15",
                HomeAddress = "вул. Українська, буд. 89, (0552) 22-55-38"
            },

            new Profile
            {
                LastName = "Носов",
                FirstName = "Павло",
                MiddleName = "Сергійович",
                BirthDate = new DateTime(1979, 1, 27),
                Position = "Доцент, Херсонський політехнічний коледж Одеського національного політехнічного університету, викладач, з 2001",
                Degree = "кандидат технічних наук, доцент за кафедрою «Природничо-наукової підготовки» спеціаліст вищої категорії",
                EducationalInstitution = "Херсонський державний педагогічний університет, 2002 р., «Педагогіка і методика середньої освіти. Трудове навчання», магістр трудового навчання;",
                AcademicDisciplines = "",
                AdvancedTraining = "Університет менеджменту НАПН України, 15.02.2016-16.09.2016, свідоцтво СП 35830447/1475-16 від 16.09.2016 Інститут модернізації змісту освіти,  08.10.2016, сертифікат про участь у тренінгу «Підготовка проектних пропозицій до програми Еразмус + (напр. Жан Моне)»",
                Seniority = "15",
                HomeAddress = "м.Херсон, вул. Шенгелія, буд. 3, кв. 264, (0552) 27-42-48"
            },

            new Profile
            {
                LastName = "Ротань",
                FirstName = "Наталя",
                MiddleName = "Вікторівна",
                BirthDate = new DateTime(1978, 7, 19),
                Position = "Старший викладач, Херсонський політехнічний коледж Одеського національного політехнічного університету, заступник директора, з 2001",
                Degree = "спеціаліст вищої категорії",
                EducationalInstitution = "Херсонський державний технічний університет, 2000р. «Фінанси і кредит», спеціаліст з фінансів і кредиту. Херсонський національний технічний університет, 2005 р. «Фінанси», магістр з фінансів",
                AcademicDisciplines = "Гроші та кредит (20), Фінанси (28), Фінанси підприємств (44), Податкова політика (46)",
                AdvancedTraining = "Херсонський національний технічний університет, 11.11.2013 – 07.12.2013, сертифікат № 11 від 07.12.2013 Інститут модернізації змісту освіти,  08.10.2016, сертифікат про участь у тренінгу «Підготовка проектних пропозицій до програми Еразмус + (напрям Жан Моне)»",
                Seniority = "17",
                HomeAddress = "м.Херсон, вул. Лавреньова, буд. 12, кв. 16, (0552) 22-55-38"
            },

            new Profile
            {
                LastName = "Савенок",
                FirstName = "Людмила",
                MiddleName = "Андріївна",
                BirthDate = new DateTime(1959, 5, 2),
                Position = "Доцент",
                Degree = "кандидат істориччних наук, доцент за кафедрою «Історії» спеціаліст вищої категорії",
                EducationalInstitution = "Гомельський державний університет, 1981 р., «Історія», викладач історії та суспільствознавства",
                AcademicDisciplines = "Історія економіки та економічної думки (30), Політологія (30)",
                AdvancedTraining = "Херсонський державний університет, 06.04.2015 – 25.04.2015, свідоцтво № 32 від 25.02.2015, «Міжпредметні зв’язки у викладанні суспільних дисциплін»",
                Seniority = "35",
                HomeAddress = "м.Херсон, вул. Тираспільська, 60а, 42, 0503969535"
            },

            new Profile
            {
                LastName = "Сафонова",
                FirstName = "Ганна",
                MiddleName = "Феліксівна",
                BirthDate = new DateTime(1983, 8, 7),
                Position = "Доцент, Херсонський політехнічний коледж Одеського національного політехнічного університету, викладач, з 2001",
                Degree = "кандидат технічних наук, доцент за кафедрою «Природничо-наукової підготовки» спеціаліст вищої категорії",
                EducationalInstitution = "Херсонський державний університет, 2005р. магістр. “Педагогіка і методика середньої освіти”. Педагогіка і методика середньої освіти. Математика, викладач математики, вчитель основ інформатики",
                AcademicDisciplines = "Диференціальні рівняння (36), Математичний аналіз  (80), Теорія ймовірності та матстатистики (34)",
                AdvancedTraining = "Отримала звання доцента у 2015 р. Херсонський національний технічний університет 20.04.2015 – 04.05.2015, стажування, «Математична формалізація алгоритму створення креслень базових конструкцій основи ліфу». «Узагальнення курсу «Теорії ймовірності та математичної статистики»», свідоцтво № 124 від 04.05.2015",
                Seniority = "11",
                HomeAddress = "м.Херсон, вул.  І. Куліка, буд. 29, кв. 272, (0552) 22-55-38"
            },

            new Profile
            {
                LastName = "Сафонов",
                FirstName = "Михайло",
                MiddleName = "Сергійович",
                BirthDate = new DateTime(1985, 7, 7),
                Position = "Старший викладач, Херсонський політехнічний коледж Одеського національного політехнічного університету, викладач, з 2001",
                Degree = "кандидат технічних наук, спеціаліст вищої категорії",
                EducationalInstitution = "Одеський національний політехнічний університет, 2010, «Компю`терні системи та мережі», спеціаліст",
                AcademicDisciplines = "Методи і засоби комп`ютерних інформаційних технологій (52), Організація комп`ютерних мереж (34)",
                AdvancedTraining = "Кандидат технічних наук, 2015 р. Запорізька дер-жавна інженерна академія, 25.04.2016 – 25.06.2016, стажування  «Мережеві технології Cisco. Апаратне та програмне забезпечення» сертифікат № 21/16",
                Seniority = "11",
                HomeAddress = "м.Херсон, вул. 295 Стрілкової дивізії, 25, кв.153, (0552) 22-56-83"
            },

            new Profile
            {
                LastName = "Семакова",
                FirstName = "Тетяна",
                MiddleName = "Олексіївна",
                BirthDate = new DateTime(1968, 10, 20),
                Position = "Доцент",
                Degree = "кандидат педагогічних наук, викладач, доцент за кафедрою «Природничо-наукової підготовки» спеціаліст вищої категорії",
                EducationalInstitution = "Херсонський державний педагогічний інститут, 1990р. «Фізика, вчитель фізики, інформатики і обчислювальної техніки»",
                AcademicDisciplines = "Теорія електричних та магнітних кіл (60), Фізика (30)",
                AdvancedTraining = "Херсонський політехнічний коледж ОНПУ, 19.01.2014 – 25.01.2014, свідоцтво № 069 від 28.02.2014, «Формування пізнавальної діяльності студентів технічних коледжів у процесі вивчення фізики»",
                Seniority = "27",
                HomeAddress = "м.Херсон, вул. Московська, б. 5а, кв. 80, (0552) 24-44-37"
            },

            new Profile
            {
                LastName = "Яковенко",
                FirstName = "Віра",
                MiddleName = "Дмитрівна",
                BirthDate = new DateTime(1960, 3, 10),
                Position = "Доцент, Херсонський політехнічний коледж Одеського національного політехнічного університету, завідувач відділенням, з 2001",
                Degree = "кандидат технічних наук, викладач, доцент за кафедрою «Природничо-наукової підготовки» спеціаліст вищої категорії, викладач методист",
                EducationalInstitution = "Херсонський індустріальний інститут, 1985р. «Технологія машинобудування, металорізальні верстати та інструменти» інженер-механік",
                AcademicDisciplines = "Операційні системи (42), Конструювання  програмного забезпечення (40)",
                AdvancedTraining = "Херсонський Університет менеджменту освіти НАПН України, 18.02.2013– 20.09.2013 Свідоцтво про підвищення кваліфікації № 333/137 від 20.09.2013 р., як завідувач відділенням ВНЗ І-ІІ рівнів акредитації, курсова підготовка «Самооцінка діяльності навчального закладу засобами автоматизованої системи»",
                Seniority = "31",
                HomeAddress = "м.Херсон, вул. 295 Стрілкової дивізії, буд. 6/9, кв. 26 (0552) 39-78-42"
            },

            new Profile
            {
                LastName = "Яковенко",
                FirstName = "Євген",
                MiddleName = "Олександрович",
                BirthDate = new DateTime(1983, 6, 19),
                Position = "Старший викладач, Херсонський політехнічний коледж Одеського національного політехнічного університету, викладач, з 2001",
                Degree = "кандидат технічних наук, спеціаліст вищої категорії",
                EducationalInstitution = "Одеський національний політехнічний університет, 2006 р. «Менеджмент зовнішньо-економічної діяльності», менеджер- економіст",
                AcademicDisciplines = "Операційні системи (42)",
                AdvancedTraining = "Отримав ступінь кандидата наук у 2015 р.",
                Seniority = "11",
                HomeAddress = "м.Херсон, вул. Небесної сотні (40 років Жовтня), 17/1, кв. 34 (0552) 22-56-83"
            },

            new Profile
            {
                LastName = "Яковенко",
                FirstName = "Олександр",
                MiddleName = "Євгенович",
                BirthDate = new DateTime(1960, 1, 1),
                Position = "Доцент, Херсонський політехнічний коледж Одеського національного політехнічного університету, директор, з 2001",
                Degree = "кандидат технічних наук, викладач, доцент за кафедрою «Природничо-наукової підготовки» спеціаліст вищої категорії, викладач методист",
                EducationalInstitution = "Київський політехнічний інститут, 1988р. „Електронні обчислювальні машини ”, інженер-системотехнік.",
                AcademicDisciplines = "Архітектура комп’ютерів (70), Комп’ютерна схемотехніка (30)",
                AdvancedTraining = "Університет менеджменту освіти НАПН України ДВНЗ «Університет менеджменту освіти центральний інститут післядипломної педагогічної освіти, директори ВНЗ І-ІІ р.а.», 27.01.2014 – 27.06.2014, свід. № 875/14 Ц від 27.06.2014, «Відкрита освіта і дистанційне навчання у ВНЗ»",
                Seniority = "30",
                HomeAddress = "м.Херсон, вул. Небесної сотні (40 років Жовтня), буд. 23-а, к. 35-41, (0552) 39-78-41"
            },

            new Profile
            {
                LastName = "Гогунський",
                FirstName = "Віктор",
                MiddleName = "Дмитрович",
                BirthDate = new DateTime(2017, 1, 1),
                Position = "",
                Degree = "",
                EducationalInstitution = "",
                AcademicDisciplines = "",
                AdvancedTraining = "",
                Seniority = "",
                HomeAddress = ""
            },
        };

        public static void Seed(IProfilesRepository profilesRepository)
        {
            var existingProfiles = profilesRepository.GetAllProfiles();

            foreach (var profile in profiles)
            {
                profile.PublicationActivity = new List<PublicationActivity>();
                profile.PublicationActivity.Add(new PublicationActivity { LastFillDate = ProfileProvider.NextLastFillDate });

                profile.ProfessionalActivity = new List<ProfessionalActivity>();
                profile.ProfessionalActivity.Add(new ProfessionalActivity { LastFillDate = ProfileProvider.NextLastFillDate });

                profile.AdditionalActivity = new List<AdditionalActivity>();
                profile.AdditionalActivity.Add(new AdditionalActivity { LastFillDate = ProfileProvider.NextLastFillDate });

                var exists = false;
                foreach (var existingProfile in existingProfiles)
                {
                    if (existingProfile.LastName.Equals(profile.LastName) &&
                        existingProfile.FirstName.Equals(profile.FirstName) &&
                        existingProfile.MiddleName.Equals(profile.MiddleName))
                    {
                        exists = true;
                        break;
                    }
                }

                if (exists)
                {
                    continue;
                }

                profilesRepository.CreateProfile(profile);
            }
        }
    }
}
